{
  "_name_or_path": "xlm-roberta-base",
  "architectures": [
    "XLMRobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Crime",
    "1": "Education",
    "2": "Environment",
    "3": "Health",
    "4": "Politics",
    "5": "Science",
    "6": "Sports",
    "7": "Technology",
    "8": "World News"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Crime": 0,
    "Education": 1,
    "Environment": 2,
    "Health": 3,
    "Politics": 4,
    "Science": 5,
    "Sports": 6,
    "Technology": 7,
    "World News": 8
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.40.0",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 250002
}
